src/Reports/ПоискЗацикливанияВСпецификациях/ПоискЗацикливанияВСпецификациях.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Report>
  <name>ПоискЗацикливанияВСпецификациях</name>
</mdclass:Report>

src/InformationRegisters/СпецификацииПредметовСнабжения/СпецификацииПредметовСнабжения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СпецификацииПредметовСнабжения</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>НомерПозиции</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>6</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Тип</name>
    <type>
      <types>CatalogRef.РазделыСпецификацииЗИП</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбозначениеСНК</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПричинаВыбораДляЗИП</name>
    <type>
      <types>CatalogRef.ПричиныВыбораПредметаСнабженияДляЗИП</types>
    </type>
  </attributes>
  <attributes>
    <name>УказательНаЭлементСхемы</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Взаимозаменяемость</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПризнакПодбора</name>
    <type>
      <types>CatalogRef.ПризнакиПодбораИлиИзготовленияПредметовСнабжения</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбозначениеЗаготовки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>ПредметСнабжения</name>
    <type>
      <types>CatalogRef.КаталогПредметовСнабжения</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СоставляющаяЧасть</name>
    <type>
      <types>CatalogRef.КаталогПредметовСнабжения</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ЗИП</name>
    <type>
      <types>Boolean</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/InformationRegisters/СпецификацииПредметовСнабженияОчередьИзменений/СпецификацииПредметовСнабженияОчередьИзменений.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СпецификацииПредметовСнабженияОчередьИзменений</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>ЭталонОбработан</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>НеОбрабатывать</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <attributes>
    <name>ОписаниеОшибки</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <dimensions>
    <name>ПредметСнабжения</name>
    <type>
      <types>CatalogRef.КаталогПредметовСнабжения</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/Catalogs/СтруктураЗаказаПоКомплектующимИзделиямИЗИП/СтруктураЗаказаПоКомплектующимИзделиямИЗИП.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>СтруктураЗаказаПоКомплектующимИзделиямИЗИП</name>
  <comment>Электронная структура комплектующих изделий и ЗИП корабля</comment>
  <hierarchical>true</hierarchical>
  <hierarchyType>HierarchyOfItems</hierarchyType>
  <owners>Catalog.Заказы</owners>
  <attributes>
    <name>Тип</name>
    <type>
      <types>CatalogRef.ТипыУзловЭлектроннойСтруктурыКомплектующихИзделийИЗИПКорабля</types>
    </type>
  </attributes>
  <attributes>
    <name>Заведование</name>
    <type>
      <types>CatalogRef.БоевыеЧасти</types>
    </type>
  </attributes>
  <attributes>
    <name>Номер</name>
    <comment>Используется для элементов с типом &quot;Группа изделий&quot;</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПредметСнабжения</name>
    <comment>Используется для элементов с типами &quot;Изделие&quot; и &quot;ЗИП&quot;</comment>
    <type>
      <types>CatalogRef.КаталогПредметовСнабжения</types>
    </type>
  </attributes>
  <attributes>
    <name>Количество</name>
    <comment>Используется для элементов с типами &quot;Изделие&quot; и &quot;ЗИП&quot;</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>7</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоВЗИПБорт</name>
    <comment>Используется для элементов с типом &quot;ЗИП&quot;</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>7</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоВЗИПБаза</name>
    <comment>Используется для элементов с типом &quot;ЗИП&quot;</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>7</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоВЗИПДЭ</name>
    <comment>Используется для элементов с типом &quot;ЗИП&quot;</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>7</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоВЗИПР</name>
    <comment>Используется для элементов с типом &quot;ЗИП&quot;</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>7</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВерсияПрошивки</name>
    <comment>Используется для элементов с типом &quot;ЗИП&quot;</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПрошивки</name>
    <comment>Используется для элементов с типом &quot;ЗИП&quot;</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДобавленИзСпецификации</name>
    <comment>Используется для элементов с типом &quot;ЗИП&quot;. Значение Истина означает программное создание при обработке изменений спецификации предмета снабжения</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипСоставляющейЧасти</name>
    <type>
      <types>CatalogRef.РазделыСпецификацииЗИП</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерПозицииСпецификации</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЗИП</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбозначениеДоп</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Помещение</name>
    <type>
      <types>CatalogRef.Помещения</types>
    </type>
  </attributes>
  <attributes>
    <name>МестоХранения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Примечание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЕстьПодчиненные</name>
    <comment>признак того, что элемент является родителем</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

src/Reports/ПоискЗацикливанияВСпецификациях/Forms/ФормаОтчета/Module.bsl
&НаСервере
Функция СоздатьЭлементСтруктурыЗаказа(Знач ЦепочкаПредметовСнабжения, СоставляющаяЧасть = Неопределено, НомерПозиции = Неопределено)
	
	// Параметр Родитель заполняется при вызове из функции СоздатьЭлементыСтруктурыЗаказов() и рекурсивном вызове
	// Параметр ЭлементСтруктурыЗаказа заполняется при вызове из функции СоздатьПодчиненныеЭлементыДляЭлементаСтруктурыЗаказа()
	
	Результат = Новый Структура("Выполнено, Описание, НеОбрабатывать, ОписаниеОшибки", Ложь, "", Ложь, "");
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ Различные
	|	СпецификацииПредметовСнабжения.СоставляющаяЧасть КАК СоставляющаяЧасть,
	|	СпецификацииПредметовСнабжения.ЗИП КАК ЗИП,
	|	СпецификацииПредметовСнабжения.Количество КАК Количество,
	|	СпецификацииПредметовСнабжения.Тип КАК Тип,
	|	СпецификацииПредметовСнабжения.НомерПозиции КАК НомерПозиции,
	|	ВЫБОР
	|		КОГДА СпецификацииПредметовСнабжения.СоставляющаяЧасть В (&ЦепочкаПредметовСнабжения)
	|				И НЕ СпецификацииПредметовСнабжения.СоставляющаяЧасть = &ПредметСнабжения
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК Зацикливание
	|ИЗ
	|	РегистрСведений.СпецификацииПредметовСнабжения КАК СпецификацииПредметовСнабжения
	|ГДЕ
	|	СпецификацииПредметовСнабжения.ПредметСнабжения = &ПредметСнабжения
	|	И НЕ СпецификацииПредметовСнабжения.ЗИП";
	
	Запрос.УстановитьПараметр("ПредметСнабжения", СоставляющаяЧасть);
	Запрос.УстановитьПараметр("ЦепочкаПредметовСнабжения", ЦепочкаПредметовСнабжения); //++ 01.11.2017 Веденеев П. //изменен механизм защиты от зацикливания
	
	ЦепочкаПредметовСнабженияКопия = Новый Массив;
	Для каждого ЭлементЦепочки Из ЦепочкаПредметовСнабжения Цикл
		ЦепочкаПредметовСнабженияКопия.Добавить(ЭлементЦепочки);
	КонецЦикла;
	
	ЦепочкаПредметовСнабженияКопия.Добавить(СоставляющаяЧасть);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		
		Результат.Выполнено = Истина;
		Возврат Результат;	
		
	КонецЕсли;
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		МаксимальныйИндекс = ЦепочкаПредметовСнабжения.ВГраница();
		
		Если Выборка.Зацикливание Тогда //++ 08.11.2017 Веденеев П. 
			
			Дерево = РеквизитФормыВЗначение("ДеревоПС", Тип("ДеревоЗначений"));
			
			ТекСтроки = Дерево.Строки;
			
			МассВсехРодителей = ПолучитьМассВсехРодителей(ЭлементЦепочки);
			Верх = МассВсехРодителей.ВГраница(); Путь = "";
			Для сч=0 По Верх Цикл
				Тек = МассВсехРодителей.Получить(Верх);
				
				НовСтр = ТекСтроки.Добавить();
				НовСтр.ПредметСнабжения = Тек;
				
				Верх=Верх-1; ТекСтроки = НовСтр.Строки;
			КонецЦикла; 
			НовСтр = ТекСтроки.Добавить();
			НовСтр.ПредметСнабжения = ЭлементЦепочки;
			
			ЗначениеВРеквизитФормы(Дерево, "ДеревоПС");
			
			Продолжить;
			
		КонецЕсли;
		
		РезультатСозданияЭлементаСтруктурыЗаказа = СоздатьЭлементСтруктурыЗаказа(ЦепочкаПредметовСнабженияКопия, Выборка.СоставляющаяЧасть, Выборка.НомерПозиции);
		
		Если Не РезультатСозданияЭлементаСтруктурыЗаказа.Выполнено Тогда
			
			Результат.Описание = РезультатСозданияЭлементаСтруктурыЗаказа.Описание;
			Результат.НеОбрабатывать = РезультатСозданияЭлементаСтруктурыЗаказа.НеОбрабатывать;
			Результат.ОписаниеОшибки = РезультатСозданияЭлементаСтруктурыЗаказа.ОписаниеОшибки;
			Возврат Результат;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Результат.Выполнено = Истина;
	Возврат Результат;	

КонецФункции // СоздатьЭлементСтруктурыЗаказа()

&НаСервере
Функция ПолучитьМассВсехРодителей(ПС, Масс = Неопределено)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	СпецификацииПредметовСнабжения.ПредметСнабжения КАК ПредметСнабжения
	|ИЗ
	|	РегистрСведений.СпецификацииПредметовСнабжения КАК СпецификацииПредметовСнабжения
	|ГДЕ
	|	СпецификацииПредметовСнабжения.СоставляющаяЧасть = &СоставляющаяЧасть
	|	И НЕ СпецификацииПредметовСнабжения.ЗИП";
	Запрос.УстановитьПараметр("СоставляющаяЧасть", ПС);
	
	Если Масс = Неопределено Тогда
		Масс = Новый Массив;
	КонецЕсли;
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Если Масс.Найти(Выборка.ПредметСнабжения) = Неопределено Тогда
			Масс.Добавить(Выборка.ПредметСнабжения);
			ПолучитьМассВсехРодителей(Выборка.ПредметСнабжения, Масс);
		Иначе
			Стоп = Истина;
		КонецЕсли; 
		
	КонецЦикла; 
	
	Возврат Масс;
	
КонецФункции

&НаСервере
Функция НайтиЗацикливаниеНаСервереОбщее()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	МАКСИМУМ(СпецификацииПС.ПредметСнабжения.Код) КАК МаксКод,
	|	КОЛИЧЕСТВО(СпецификацииПС.ПредметСнабжения) КАК КолВсего
	|ИЗ
	|	РегистрСведений.СпецификацииПредметовСнабжения КАК СпецификацииПС
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СпецификацииПредметовСнабженияОчередьИзменений.СрезПоследних КАК СпецПСОчередьСрезПоследних
	|		ПО СпецификацииПС.ПредметСнабжения = СпецПСОчередьСрезПоследних.ПредметСнабжения
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СтруктураЗаказаПоКомплектующимИзделиямИЗИП КАК СтруктураЗаказаПоКомплектующимИзделиямИЗИП
	|		ПО СпецификацииПС.ПредметСнабжения = СтруктураЗаказаПоКомплектующимИзделиямИЗИП.ПредметСнабжения
	|ГДЕ
	|	СпецПСОчередьСрезПоследних.ПредметСнабжения ЕСТЬ NULL
	|	И НЕ СтруктураЗаказаПоКомплектующимИзделиямИЗИП.Ссылка ЕСТЬ NULL";
	
	Выборка = Запрос.Выполнить().Выбрать();

	Стру = Новый Структура();
	
	Если выборка.Следующий() Тогда
		стру.Вставить("КолВсего", выборка.КолВсего);
		стру.Вставить("МаксНомер", выборка.МаксКод);
	КонецЕсли;
	
	Возврат Стру;
	
КонецФункции 

&НаСервере
Процедура НайтиЗацикливаниеНаСервере(Порция, Номер)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	СпецификацииПС.ПредметСнабжения КАК ПредметСнабжения,
	|	СпецификацииПС.ПредметСнабжения.Код КАК ПредметСнабженияКод
	|ИЗ
	|	РегистрСведений.СпецификацииПредметовСнабжения КАК СпецификацииПС
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СпецификацииПредметовСнабженияОчередьИзменений.СрезПоследних КАК СпецПСОчередьСрезПоследних
	|		ПО СпецификацииПС.ПредметСнабжения = СпецПСОчередьСрезПоследних.ПредметСнабжения
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СтруктураЗаказаПоКомплектующимИзделиямИЗИП КАК СтруктураЗаказаПоКомплектующимИзделиямИЗИП
	|		ПО СпецификацииПС.ПредметСнабжения = СтруктураЗаказаПоКомплектующимИзделиямИЗИП.ПредметСнабжения
	|ГДЕ
	|	СпецПСОчередьСрезПоследних.ПредметСнабжения ЕСТЬ NULL
	|	И НЕ СтруктураЗаказаПоКомплектующимИзделиямИЗИП.Ссылка ЕСТЬ NULL
	|	И СпецификацииПС.ПредметСнабжения.Код >= &НачКод
	|	И СпецификацииПС.ПредметСнабжения.Код <= &КонКод
	|	И НЕ СпецификацииПС.ЗИП
	|
	|УПОРЯДОЧИТЬ ПО
	|	СпецификацииПС.ПредметСнабжения.Код";
	
	Запрос.УстановитьПараметр("НачКод", ПРАВ("0000000000" + Формат(Номер,"ЧГ="),9));
	Запрос.УстановитьПараметр("КонКод", ПРАВ("0000000000" + Формат(Число(Номер) + Порция,"ЧГ="),9));
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Масс = новый Массив;
		Масс.Добавить(Выборка.ПредметСнабжения);
		
		СоздатьЭлементСтруктурыЗаказа(Масс, Выборка.ПредметСнабжения);
		
	КонецЦикла;	
	
КонецПроцедуры

&НаКлиенте
Процедура ПоискЗацикливания(Команда)
	
	ВремяНачалаОбработки = ТекущаяДата(); 
	
	Сообщить("" + ТекущаяДата() + ": Начало обработки");
	
	УправлениеИнтерфейсом.ВывестиТекущееСостояние("Заполнение исходных данных", ВремяНачалаОбработки, 1, 1);
	
	Стру = НайтиЗацикливаниеНаСервереОбщее();
	
	ОбщееКоличество = Стру.КолВсего;
	
	Порция = МАКС(Цел(ОбщееКоличество/1000), 1);
	
	ТекСчетчик = 0; Номер = 0;

	Пока ТекСчетчик < ОбщееКоличество Цикл
		
		УправлениеИнтерфейсом.ВывестиТекущееСостояние("Поиск зацикливаний...", ВремяНачалаОбработки, ТекСчетчик, ОбщееКоличество);
		
		НайтиЗацикливаниеНаСервере(Порция, Номер);
		
		ТекСчетчик = МИН(ТекСчетчик + Порция, ОбщееКоличество);
		
		Номер = Номер + Порция;
		
		ОбработкаПрерыванияПользователя();
		
	КонецЦикла; 
	
	СтрПрошло = "";
	Если ТекСчетчик Тогда
		
		УправлениеИнтерфейсом.ВывестиТекущееСостояние("Поиск зацикливаний...", ВремяНачалаОбработки,ОбщееКоличество,ОбщееКоличество,СтрПрошло);
		
	КонецЕсли;
	
	Сообщить("" + ТекущаяДата() + ": Окончание обработки (затрачено: " + СтрПрошло + ")");
	
КонецПроцедуры

&НаКлиенте
Процедура ДеревоПСВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ПоказатьЗначение(,Элемент.ТекущиеДанные.ПредметСнабжения);
	
КонецПроцедуры
